//迷路コンソールアプリ
/*
•主人公を[w] [s] [a][d] キーで上下左右に1 マス移動して、迷
路を脱出するゲーム。
•迷路は64×64 マス。画面に表示されるのは主人公を中心にし
た縦横4 マス。
•“■”移動できないブロックマスを で表現する。
•“○”主人公は で表示される。
•“  ”移動可能なマスは （全角スペース）で表現する。
•“ ”ゴールは Ｇ で表示される
*/

public class App {
    //変数
    /*
     * マップデータ maze[char][char]
     */
    public static void main(String[] args) throws Exception {

        //ファイル読み込み

        //繰り返しはじめ
    
        //入力受付
        //配列を更新
        //マップを表示
        //ゴールか判定 誤なら繰り返し　正なら繰り返し終わり

    }
}
